test/jmeter/stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Beer Garden Stress Test">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Generate Requests">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Compelted Request">
          <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
          <stringProp name="HTTPSampler.port">2337</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/requests</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;system&quot;: &quot;echo&quot;,&#xd;
    &quot;is_event&quot;: false,&#xd;
    &quot;updated_at&quot;: 1712240595057,&#xd;
    &quot;metadata&quot;: {},&#xd;
    &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
    &quot;parent&quot;: null,&#xd;
    &quot;has_parent&quot;: false,&#xd;
    &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
    &quot;children&quot;: [],&#xd;
    &quot;created_at&quot;: 1712240594955,&#xd;
    &quot;instance_name&quot;: &quot;default&quot;,&#xd;
    &quot;source_garden&quot;: &quot;default&quot;,&#xd;
    &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
    &quot;output&quot;: &quot;Hello, World!&quot;,&#xd;
    &quot;parameters&quot;: {&#xd;
        &quot;message&quot;: &quot;Hello, World!&quot;,&#xd;
        &quot;loud&quot;: false&#xd;
    },&#xd;
    &quot;error_class&quot;: null,&#xd;
    &quot;target_garden&quot;: &quot;parent&quot;,&#xd;
    &quot;requester&quot;: &quot;anonymous&quot;,&#xd;
    &quot;hidden&quot;: false,&#xd;
    &quot;command&quot;: &quot;say&quot;,&#xd;
    &quot;status&quot;: &quot;SUCCESS&quot;,&#xd;
    &quot;status_updated_at&quot;: 1712240595059,&#xd;
    &quot;comment&quot;: &quot;&quot;,&#xd;
    &quot;namespace&quot;: &quot;parent&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Beer Garden Child Requesters" enabled="false">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">120</intProp>
        <longProp name="ThreadGroup.duration">3600</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <RandomController guiclass="RandomControlGui" testclass="RandomController" testname="Random Controller">
          <intProp name="InterleaveControl.style">1</intProp>
        </RandomController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Echo Request">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;system&quot;: &quot;echo&quot;,&#xd;
	&quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
	&quot;namespace&quot;: &quot;child&quot;,&#xd;
	&quot;command&quot;: &quot;say&quot;,&#xd;
	&quot;comment&quot;: &quot;&quot;,&#xd;
	&quot;output_type&quot;: &quot;STRING&quot;,&#xd;
	&quot;instance_name&quot;: &quot;default&quot;,&#xd;
	&quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
	&quot;parameters&quot;: {&#xd;
		&quot;message&quot;: &quot;Hello, World!&quot;,&#xd;
		&quot;loud&quot;: false&#xd;
	}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Complex Echo Bool">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;complex&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;child&quot;,&#xd;
  &quot;command&quot;: &quot;echo_bool&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;b&quot;: true&#xd;
  },&#xd;
  &quot;instance_name&quot;: &quot;c1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Dynamic Get Choices">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;dynamic&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;child&quot;,&#xd;
  &quot;command&quot;: &quot;get_choices&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;JSON&quot;,&#xd;
  &quot;command_type&quot;: &quot;INFO&quot;,&#xd;
  &quot;parameters&quot;: {},&#xd;
  &quot;instance_name&quot;: &quot;d1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Max Concurrent Five">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;max_conccurent&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;child&quot;,&#xd;
  &quot;command&quot;: &quot;five_concurrent&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Nested Callls Five">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;nested-calls&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;child&quot;,&#xd;
  &quot;command&quot;: &quot;level_5_json&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;JSON&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Child Parent Who Am I">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;parent&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;child&quot;,&#xd;
  &quot;command&quot;: &quot;who_am_i&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Echo Request">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;system&quot;: &quot;echo&quot;,&#xd;
	&quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
	&quot;namespace&quot;: &quot;parent&quot;,&#xd;
	&quot;command&quot;: &quot;say&quot;,&#xd;
	&quot;comment&quot;: &quot;&quot;,&#xd;
	&quot;output_type&quot;: &quot;STRING&quot;,&#xd;
	&quot;instance_name&quot;: &quot;default&quot;,&#xd;
	&quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
	&quot;parameters&quot;: {&#xd;
		&quot;message&quot;: &quot;Hello, World!&quot;,&#xd;
		&quot;loud&quot;: false&#xd;
	}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Complex Echo Bool">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;complex&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;parent&quot;,&#xd;
  &quot;command&quot;: &quot;echo_bool&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {&#xd;
    &quot;b&quot;: true&#xd;
  },&#xd;
  &quot;instance_name&quot;: &quot;c1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Dynamic Get Choices">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;dynamic&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;parent&quot;,&#xd;
  &quot;command&quot;: &quot;get_choices&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;JSON&quot;,&#xd;
  &quot;command_type&quot;: &quot;INFO&quot;,&#xd;
  &quot;parameters&quot;: {},&#xd;
  &quot;instance_name&quot;: &quot;d1&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Max Concurrent Five">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;max_conccurent&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;parent&quot;,&#xd;
  &quot;command&quot;: &quot;five_concurrent&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Nested Callls Five">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;nested-calls&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;parent&quot;,&#xd;
  &quot;command&quot;: &quot;level_5_json&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;JSON&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Parent Parent Who Am I">
            <stringProp name="HTTPSampler.domain">beer-garden-parent</stringProp>
            <stringProp name="HTTPSampler.port">2337</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/requests?blocking=true&amp;timeout=-1</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
  &quot;system&quot;: &quot;parent&quot;,&#xd;
  &quot;system_version&quot;: &quot;3.0.0.dev0&quot;,&#xd;
  &quot;namespace&quot;: &quot;parent&quot;,&#xd;
  &quot;command&quot;: &quot;who_am_i&quot;,&#xd;
  &quot;comment&quot;: &quot;&quot;,&#xd;
  &quot;output_type&quot;: &quot;STRING&quot;,&#xd;
  &quot;instance_name&quot;: &quot;default&quot;,&#xd;
  &quot;command_type&quot;: &quot;ACTION&quot;,&#xd;
  &quot;parameters&quot;: {}&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>